{
  "main": {
    "name":"Darshan Kodipalli",
    "occupation":"Software Engineer",
    "description":"Software Developer with an experience in developing Decentralised Web applications using Ethereum Public and Hyperledger Private Blockchains. Developed quite a number of web applications that had their functionalities extended to Hyperledger Blockchain. Working experience in Docker-ising the infrastructure and bringing them up using Docker-Compose and AWS's CodePipeline. Well versed in building a continuous integration and delivery (CI/CD) workflow for the serverless applications using the AWS Developer tools. Working experience is implementing Continuous Integration and Continuous Delivery and Deployment using bitbucket’s Pipelines for various platforms.",
    "image":"resize.png",
    "bio":"Working experience in Docker-ising the infrastructure and bringing them up using Docker-Compose and AWS's CodePipeline. Well versed in building a continuous integration and delivery (CI/CD) workflow for the serverless applications using the AWS Developer tools. Working experience is implementing Continuous Integration and Continuous Delivery and Deployment using bitbucket’s Pipelines for various platforms. Working experience in developing hybrid mobile applications for Android and IOS using Ionic and Cordova and Native android applications using Java. Fascinated to solve modern problems in Computer Science focusing mainly on Distributed Computing and Machine Learning. In addition, I spend most of my time cooking and playing soccer, as a medium to fight the stress. Preparing food, for me is one of life’s greatest joys one can ever experience. I spend most of my life in front of Screens, and cooking for me is one of the best antidote.",
    "contactmessage":"To Hire me, Contact me at..",
    "email": "darshan.kodipalli@gmail.com",
    "phone": "(312) 973-9215",
    "address":{
      "street":"2951, South King Drive",
      "city":"Chicago",
      "state":"Illinois",
      "zip": "60616"
    },
    "website": "https://www.linkedin.com/in/dkodipalli/",
    "resumedownload":"https://www.linkedin.com/in/dkodipalli/",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/dkodipalli/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/DarshanKodipalli",
        "className":"fa fa-github"
      },
      {
        "name":"facebook",
        "url":"https://kk-kz.facebook.com/darshan.kodipalli",
        "className":"fa fa-facebook"
      },
      {
        "name":"twitter",
        "url":"https://twitter.com/KodipalliD",
        "className":"fa fa-twitter"
      },
      {
        "name":"instagram",
        "url":"https://www.instagram.com/nahsrad_k/",
        "className":"fa fa-instagram"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Illinois Institute of Technology",
        "degree":"Masters of Science in Computer Science",
        "graduated":"May, 2021",
        "description":"Completed courses on Enterprise Web application, Mobile Application Development, Advanced Database Organization, System and Network Security, Information security, Computer Networks. Built 2 websites ~ Best deal (e-commerce website) and Rideshare as a part of the Enterprise Web application course and 5 Android applications as a part of Mobile Application Development Course."
      },
      {
        "school":"Visvesvaraya Technological University",
        "degree":"Bachelors in Computer Science",
        "graduated":"July, 2016",
        "description":"Most Innovative Project - 2016 | Published a Paper on Port Scanning Methodologies ~ NCICT 2015 | Best Graphics Project - 2014 | Coordinator of Furore-2012 | Runner-up of College's Football Tournament"
      }
    ],
    "work":[
      {
        "company":"Manifest",
        "title":"Software Engineer Intern",
        "years":"May, 2020 - Present",
        "description":"● Developed an Admin application and Component library design system for tracking the 401k transfers using React.js ● Standardized the builds, automated the tests and deployments using bitbucket’s CI/CD pipelines ● Containerized the application using docker and deployed it on AWS’s Elastic Container Service which made the application fault-tolerant and that also improved the performance of the application by a significant margin ● Deployed the front-end application on AWS’s S3 bucket by also moving to objects to the intelligent tiering model that saved the cost of hosting the application by a considerable margin ● Implemented Content Delivery network using CloudFront to the application which prevented the site crashes during traffic surges"
      },
      {
        "company":"Aeries Blockchain Corporation",
        "title":"Blockchain Developer",
        "years":"April, 2018 - July, 2019",
        "description":" ● Optimized the Ethereum platform to run at 100 transactions/second and came up with a mechanism to secure private keys without having a single point of failure. Engineered an eventual consistency system using Redis to improve the transaction rate ● Built a NodeJS microservice connecting an ethereum DAPP and exposing REST API while storing each new event in MongoDB ● Implemented a NodeJS script for auto-generating deployable Docker containers to add secure Quorum nodes ● Developed a custom multi-sig wallet smart contract and contributed to secure the private keys within a Docker container"
      },
      {
        "company":"Xanbell Technologies",
        "title":"Software Engineer",
        "years":"January, 2017 - April 2018",
        "description":"● Built a NodeJS web application that interfaced with ethereum to handle student document verification and redesigned the ethereum smart contracts, which reduced gas consumption by 25-30 % ● Dockerized the product and made is highly scalable and increased its availability using Kubernetes. ● Devised a signature-based authentication for inter-microservice communication between 4 microservices ● Was part of the 5-member team which designed and implemented a spring boot web application for corporate relocation"
      },
      {
        "company":"Rare Mile Technologies",
        "title":"Software Engineer",
        "years":"July, 2016 - January, 2017",
        "description":"● Worked on the user interface for an Inventory Management System and contrived a custom authentication mechanism loosely based on OAuth in the backend and developed a system using Python and C++ to read RFID tags and send the data securely to the cloud"
      },
      {
        "company":"Taurus Hard Soft Solutions Pvt Ltd",
        "title":"Internship",
        "years":"September, 2015 - December 2015",
        "description":"Trained on Network Configurations."
      }
    ],
    "skills":[
      {
        "name":"Hyperledger",
        "level":"90%"
      },
      {
        "name":"Ethereum",
        "level":"65%"
      },
      {
        "name":"NodeJS",
        "level":"90%"
      },
      {
        "name":"Java",
        "level":"90%"
      },
      {
        "name":"Angular.js",
        "level":"80%"
      },
      {
        "name":"ReactJS",
        "level":"70%"
      },
      {
        "name":"MongoDB",
        "level":"80%"
      },
      {
        "name":"AWS",
        "level":"90%"
      },
      {
        "name":"Pivotal",
        "level":"60%"
      },
      {
        "name":"Docker / Docker-Compose",
        "level":"100%"
      },
      {
        "name":"Jenkins",
        "level":"90%"
      },
      {
        "name":"Git",
        "level":"60%"
      },
      {
        "name":"BitBucket",
        "level":"80%"
      },
      {
        "name":"REST / GraphQL",
        "level":"80%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"BestDeal",
        "category":"BestDeal is an online web portal for users to login and Shop.",
        "image":"rsz_best.png",
        "url":"https://github.com/DarshanKodipalli/BestDeal-Web-Application"
      },
      {
        "title":"Manage 401(K)",
        "category":"Digitisation of disbursing and tracking of the 401(k) contributions by the employees.",
        "image":"rsz_manifest.png",
        "url":"https://github.com/DarshanKodipalli/manage401K"
      },
      {
        "title":"RideShare",
        "category":"A web application to manage taxi ridesharing using Java Servlets, Python, AngularJS and Machine Learning.",
        "image":"rsz_rideshare.png",
        "url":"https://github.com/DarshanKodipalli/RideShare"
      },
      {
        "title":"Order Tracker",
        "category":"Developed a Decentralised web application using the MEAN stack and Hyperledger Fabric that simulates the Inventory Management System starting from placing an order, approving it by a checker and receiving the order",
        "image":"rsz_1art.png",
        "url":"https://github.com/DarshanKodipalli/ART"
      }

    ]
  },
  "certifications":{
    "certificates": [
      {
        "title":"Building Scalable Java Microservices with Spring Boot and Spring Cloud",
        "category":"Coursera ~ 3R8FZP94NL3F",
        "image":"coursera.png",
        "id":"3R8FZP94NL3F",
        "url":"https://www.coursera.org/account/accomplishments/verify/3R8FZP94NL3F"
      },
      {
        "title":"Blockchain Development on Hyperledger Fabric using Composer",
        "category":"Udemy ~ UC-LH2T2DW2",
        "image":"udemy2.png",
        "id":"UC-LH2T2DW2",
        "url":"http://ude.my/UC-LH2T2DW2"
      }
    ]
  },  
  "testimonials":{
    "testimonials":[
      {
        "text":"Darshan is a diligent and responsible team member. He worked with me for more than two years for many blockchain projects. In 2017, Blockchain was a fresh ecosystem with not so many sophisticated tools and knowledge artifacts available. It needed a lot of patience to research, investigate and implement the solution. Darshan was always up for it. I wish him good luck. I am sure he will be an asset to any team that he works with and will always be a Go-to employee for his manager. ",
        "user":"Rahul Golash  (VP Emerging Technologies at The Block Ledger)",
        "userURL":"https://www.linkedin.com/in/rahulgolash/"
      },
      {
        "text":"Darshan was a fantastic person to work with and is multi-skilled. We worked together on developing web applications with smart contract development on Ethereum, Hyperledger Fabric projects. He was always capable of adapting to new working environments. He has good knowledge of DevOps tools and Security Attacks. I highly recommend him.",
        "user":"Praveen Challa (Senior Software Engineer at U&Me Communication)",
        "userURL":"https://www.linkedin.com/in/pravn1729/"
      },
      {
        "text":"Darshan was a asset to the team, his contributions and support has helped build our product faster and with fewer bugs .Darshan used to pro actively seek tasks even if the technology was alien to him he used to do a quick crash course and get started with the task. His project demonstrations and knowledge sharing was very apt and well done. I thanks Darshan for all his contributions and would definitely like to work with him again if roads cross. All the best!  ",
        "user":"Divya Nair  (I am a #Futureshaper)",
        "userURL":"https://www.linkedin.com/in/divya-nair-85a004113/"
      },
      {
        "text":"Darshan is one of those people who genuinely has passion for technology and a hunger to learn new things. He is someone you can completely depend on. He has a depth of knowledge in his areas of expertise such as Blockchain and DevOps. While working together, I could see that he is always willing to lend a helping hand to others when in need. Being a great team player, he would be an asset to any org.",
        "user":"Prasath Thangaraj  (Director, Engineering (Hiring for Java, Automation, DevOps, UI, DB))",
        "userURL":"https://www.linkedin.com/in/prasvo/"
      }
    ]
  }
}